{"texts": ["Olá, {firstName}! Tudo bem?\n\nA Turing está contratando um novo Back-end Engineer para a Coinbase na modalidade de Contractor.\n\n---Resumo da vaga---\n\nStack principal:\n- Golang\n- Cloud (AWS ou GCP)\n- NoSQL (MongoDB ou DynamoDB)\n\nBenefícios:\n- Nenhum benefício específico, pois como Contractor, geralmente o único benefício é a flexibilidade de tirar suas folgas/férias quando quiser.\n\nRemuneração:\n- Você define o valor na hora de preencher o formulário de interesse. No entanto, é bom saber que os candidatos que passam comigo estão na faixa dos 5-7.5K USD/mês.\n\nProcesso Seletivo:\n- Se passar na etapa de análise de currículo (Ter aproximadamente 3 anos de experiência com Golang), vai para a etapa de Live Coding (geralmente no LeetCode) e depois é enviado para o cliente.\n\nAcho que cobri a maioria das dúvidas frequentes.\n\nSe quiser prosseguir, é só clicar no link abaixo, preencher o breve formulário de interesse e me avisar para que eu possa requisitar a revisão do seu CV.\n\nhttps://developers.turing.com/invite/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJqb2JJZCI6MjAyNjEsInVzZXJJZCI6NDA1LCJ1c2VyUm9sZSI6IlRBX1NPVVJDRUQiLCJpYXQiOjE3MjIzNTE3NjN9.zvA6rE55eC6kHiw-G8sDDumVePA6jxB7idclHChDwcU\n\nFicou alguma dúvida??\n\nPS: É necessário inglês em nível de conversação 😊", "Sem problemas! Te agradeço por ter respondido minha mensagem mesmo assim. Desse modo, eu recupero meu InMail, e posso utilizar novamente haha\n\nBoa semana!", "Boa!\n\nEnviado para etapa técnica 🚀\n\nAqui, não tem muito para onde fugir. É aquele padrão Norte-Americano, de conversa, em inglês, estruturada com perguntas sobre as tecnologias principais, e quase 90% das vezes, um Live Coding que é feito pela plataforma do LeetCode. \n\nPassando nessa etapa, enviamos para o cliente. Caso não te deem nenhum feedback uns 2 ou 3 dias depois de tu fazer, me avisa aqui que eu dou uma olhada para ti, mas geralmente dão.\n\nBoa sorte, e espero que consiga se dar bem lá!", "Sem problemas! Te agradeço por ter respondido minha mensagem mesmo assim. Desse modo, eu recupero meu InMail, e posso utilizar novamente haha\n\nQuando tiver afiado no inglês, me procura, que a gente busca algo para você 💪\n\nBoa semana!", "Hey {firstName}!\n\nHonestly, that's not necessary right now. With your experience, I could easily send your profile straight to the technical calls, but unfortunately, that won't be possible because of the rate.\n\nThis client is willing to pay up to $5,190 USD/month, which is way lower than you are expecting. I totally think that the rate you requested is a good fit for the number of years and roles that you have occupied, but I am not in charge of setting the rate, so I can't go higher than that.\n\nI thank you for taking the time to fill out the form and for the interest shown, but we can't meet the amount of money that you are currently expecting.\n\nBest regards,\n\nPaulo Muniz", "No problem! Thanks for replying to my message 😊", "Hey {firstName}!\n\nFirst of all, thanks for replying to my message 😁\n\nRegarding this job, let me give you all the information I have about it so you can decide if it's worth participating.\n\nThis client is a company that has been working with us for quite some time, and they need to hire someone to be a tech lead for one of their squads. They expect this person to be technically experienced with TypeScript, Python, and another framework/language to manage this team. Due to the nature of their work, it's crucial that this person has good experience dealing with large GitHub repositories (public/private).\n\nPlease check out the full job description and fill in the job interest form if you think this is for you. Then, let me know so I can review it and send it to the technical team for evaluation 😁😉 Also, if you are interested and fill out the form, please don't use any AI tools to do it. You don't need to create a huge text; just explain it well because the answers will be reviewed by a human, not a machine.\n\nHere is the link:\n\nhttps://developers.turing.com/invite/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJqb2JJZCI6MjE5MzYsInVzZXJJZCI6NDA1LCJ1c2VyUm9sZSI6IlRBX1NPVVJDRUQiLCJpYXQiOjE3MjI1Mjk2NTl9.BaNDBtZlJdH_ygbZ2SvFRNbXBS28oPx7TkrlWO-wpCM", "Hey {firstName},\n\nI hope you are having a good week so far.\n\nWhile I was waiting on your answer, I reviewed your LinkedIn profile and sent it forward for evaluation because I thought it was well-aligned with the job. Unfortunately, the technical team reviewed your profile and determined it doesn't align as closely with the current needs of our client as I initially thought. \n\nI wanted to thank you for your interest and the time you took to fill out the form, but I’m unable to continue with your application at this point.\n\nThanks!", "Awesome!\n\nI'll forward it to the technical team. If they don't contact you by the end of the week, let me know so I can take a look :)", "Hey {firstName},\n\nI hope you are having a good week so far.\n\nI reviewed your LinkedIn profile + Job Interest Form and sent it forward for evaluation because I thought it was well-aligned with the job. Unfortunately, the technical team reviewed your profile and determined it doesn't align as closely with the current needs of our client as I initially thought. \n\nThey told me that after talking to some candidates, they decided to up the number of years of experience to 7 or 8. So, unfortunately, we won't be able to continue with your application for now :/\n\nI wanted to thank you for your interest and the time you took to fill out the form, but I’m unable to continue with your application at this point.\n\nThanks!", "{firstName} thanks for taking your time to fill up the form!\n\nI want to share some more specific information regarding you experience with Python & Typescript - this will improve your chances of passing through this part of the vetting process.\n\nCan you give me a really brief explanation about your overall experience with Python & TS?", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "button_texts": ["[+] Coinbase", "[-] Coinbase", "[MTI] Coinbase", "ENGLISH - GENERAL", "MONEY - GENERAL", "NEGATIVE - GENERAL", "[+++] TECH LEAD", "PROFILE - GENERAL", "FOLLOW UP - GENERAL", "[YoE] TEAM LEAD", "[+EXP] TEAM LEAD", "-", "-", "-", "-", "-", "Copy Text", "-", "-", "-", "Copy Text", "Copy Text", "Copy Text", "Copy Text", "Copy Text"], "counters": [71, 45, 1, 0, 3, 4, 5, 1, 1, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]}