{"texts": ["Thanks for replying 💪\n\nI hope you're well! I'm looking for a Data Engineer with expertise in Python and Snowflake for a full-time remote role in LATAM (PST overlap). The contract is initially for 6 months (extension intended). Key responsibilities include designing automated data solutions and maintaining applications. Must have 4+ years in software development with strong skills in data manipulation and database handling (JD Annexed or I can copy & paste here for you)\n\n As this will be a contractor role, the rate is around 6-7.5K USD/monthly.\n\nLet me know if you are interested. If so, I have to ask you just one follow up question before setting the interview 😊\n\nWaiting on your answer,\n\nBest regards,", "What I usually do is conduct a quick interview to explain the process to you. After that, I’ll send you a Google form I created with four questions about your technical experience (it usually takes less than 5 minutes). Finally, I compile all this information and pass it along to the Account Manager.\n\nWould you like to participate? 🤔\n\nIf so, here's the link to schedule a call:\n\nhttps://calendly.com/paulo-teamtorc/15min\n\nAlso, IF you want to get ahead and fill up the questions, it will save us sometime after the call, but it is not mandatory 💪\n\nhttps://forms.gle/RpqRbPJFwWAmW3zW6", "What I usually do is conduct a quick interview to explain the process to you. After that, I’ll send you a Google form I created with four questions about your technical experience (it usually takes less than 5 minutes to complete). Finally, I compile all this information and pass it along to the Account Manager.\n\nWould you like to participate? 🤔\n\nIf so, here's the link to schedule a call:\n\nhttps://calendly.com/paulo-teamtorc/15min\n\nAlso, IF you want to get ahead and fill up the questions, it will save us sometime after the call, but it is not mandatory 💪\n\nhttps://forms.gle/RpqRbPJFwWAmW3zW6", "No problem, if you do know any Data Engineer with a good experience in both Python & Snowflake, let me know 😊\n\nHave a great day!", "Of course!\n\nIf you happen to know someone with this profile that might be interested, you can send my way 😎", "Ohhh... 🫠\n\nUnfortunately for this role they need English, as you will be also dealing with the global team.", "Hey {firstName}!\n\nSo, should we proceed, or let this one pass for now? I'll wait until the EOD to understand if you are still interested. Thanks!", "Hi {firstName}!\n\nFirst of all, thank you for replying to my message! 😎\n\nIf this opportunity isn’t the right fit for you, please let me know. Sometimes my Boolean search may match someone who doesn’t perfectly align due to my limited knowledge of the role.\n\nWe’re working with a client looking for an SDET with skills related to the MDM domain to join their MDM team. This team is responsible for ensuring the reliability, accuracy, and performance of the MDM platform (Reltio) and its integrations with customer preference platforms like OneTrust or PossibleNow.\n\nThis position is fully remote, direct hire with the client — we at Randstad Torc are responsible only for finding and referring interested candidates to them. The company is a major U.S. player in the mortgage industry, known for using technology to streamline processes and deliver customer-focused solutions.\n\nThe client operates in PST.\n\nI’ve attached the full job description as a PDF but can paste it here if you prefer.\n\nAfter reviewing, do you think this role might be a good fit for you? If not, do you know someone who might be interested?\n\nThank you again!", "That's great 😎\n\nSo, let me give you a quick overview on how the process is being handled: Randstad Torc is the responsible for finding candidates that are interested in the position. If they are, we check if they have the mandatory &/OR bonus skills and send them to the client to do the interview - and hiring.\n\nFor that, basically, we have a quick intro call with me - should last 5-10min - then I move you to the vetting team in Randstad Torc with all the information that is needed. From there, they will contact you and then move you later to the client - to be interviewed there. \n\nIf that process is ok for you, you can schedule a quick call with me in a time that works best for you, what do you think?\n\nHere's my calendar link:\n\nhttps://calendly.com/paulo-teamtorc/15min", "", "No problem! Thanks for replying. If you can think up anyone with that skillset that would be willing to get a direct hire with a US company, let me know, I can show it to them 💪", "Hey {firstName}!\n\nActually, something went wrong with my Boolean search 🤔 This is a SDET role, and I specifically built a search to find candidates who has been working as a SDET for at least 3 years. I'm sorry, but unfortunately this position doesn't match your current experience 🫠 But, out of curiosity, if you do someone in that profile in JD, you can send my way, and I can try to help them out. \n\nThanks for help and sorry about the mix up!", "Soooo... \n\nHere's my WA number: +55 51 998 924 565\n\nRegarding the process, here's the link to fill up the form that I need regarding your information (should take <5min to fill):\nhttps://forms.gle/BKEwRdGaT9fpkPyD9\n\nAnd the link to create your account at Torc and upload your CV there:\n- https://platform.torc.dev/#/r/23mwute9/cp\n\nI would advise you to add as much information regarding the experience related to this role in the CV. \n\nWe are moving candidates forward to the next steps as soon as they are ready, so, once you're done, let me know, please.\n\nThanks, and good luck!", "No problem, thanks for replying 😎💪", "Have you had time to give it a look, what you do you think?", "Hey!\n\nI've been told recently to hold on before scheduling any interviews or reach out to new candidates, as the client told us that they are going to first interview the candidates we sent last week. They won't be accepting new candidates for now.\n\nSo, I would like to know if it would be ok for you for us to postpone our interview to when we are able to send new candidates again. Is that ok for you? \n\nIf it is, as soon as I get news about it - even if they close the position - I will send you some feedback.\n\nBest regards", "Hey!\n\nI've been told recently to hold on before scheduling any interviews or reach out to new candidates, as the client told us that they are going to first interview the candidates we sent last week. They won't be accepting new candidates for now.\n\nIf the role opens up again, I will drop you a message here so we can talk, is that ok?\n\nBest regards!"], "button_texts": ["DATA - Ok", "Data - Follow Up", "Data - Follow up 2", "Data - Not Interested", "-", "English", "Last Call", "OK - SDET", "FOLLOW UP - SDET", "OK ($$$) SDET", "nOK - NOT INTERESTED", "Wrong STACK - SDET", "POST CALL - SDET", "Copy Text", "Copy Text", "ON HOLD", "ON HOLD - 1st contact"], "button_colors": ["#0000ff", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black", "black"], "button_bg_colors": ["#ffffff", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray", "lightgray"], "frame_positions": [{"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}, {"in": ".!frame.!canvas.!frame", "anchor": "center", "expand": "0", "fill": "x", "ipadx": "0", "ipady": "0", "padx": "0", "pady": "10", "side": "top"}], "window_size": {"width": 399, "height": 341, "x": 338, "y": 338}}